In [2]:
import pandas as pd

In [5]:
conn_uri = "postgresql://robot-startml-ro:pheiph0hahj1Vaif@postgres.lab.karpov.courses:6432/startml"
userdata = pd.read_sql(
    "SELECT * FROM public.user_data",             
    conn_uri                                 
)
userdata.head()

   user_id  gender  age country               city  exp_group       os source
0      200       1   34  Russia          Degtyarsk          3  Android    ads
1      201       0   37  Russia             Abakan          0  Android    ads
2      202       1   17  Russia           Smolensk          4  Android    ads
3      203       0   18  Russia             Moscow          1      iOS    ads
4      204       0   36  Russia  Anzhero-Sudzhensk          3  Android    ads

In [6]:
postdata = pd.read_sql(
    "SELECT * FROM public.post_text_df" ,             
    conn_uri                                 
)
postdata.head()

   post_id                                               text     topic
0        1  UK economy facing major risks\n\nThe UK manufa...  business
1        2  Aids and climate top Davos agenda\n\nClimate c...  business
2        3  Asian quake hits European shares\n\nShares in ...  business
3        4  India power shares jump on debut\n\nShares in ...  business
4        5  Lacroix label bought by US firm\n\nLuxury good...  business

In [ ]:
feeddata = pd.read_sql(
    "SELECT * FROM public.feed_data",             
    conn_uri                                 
)
feeddata.head()